<?php
/* ###############################################################################
 *
 * システム名
 *   ラジカルオプティ サロン事業 POSシステム
 *
 * 機能
 *   CahePHP データベース設定 [個人・デフォルト環境]
 *
 * バージョン
 *   0.0.0_0
 *
 * 履歴
 *   2016/02/08 K.Sonohara
 *     新規作成
 *
 * ###############################################################################
 */

// ###############################################################################
//  変数・定義値
// ###############################################################################

/**
 * rdb: モデル及びセッション及び用データベース設定
 * s3: AWS S3設定.
 */
return array(
    'rdb' => array(
        'datasource' => 'Database/Mysql',
        'persistent' => false,
        'host' => 'localhost',
        'login' => 'root',
        'password' => 'root',
        'database' => 'salon_app',
        'prefix' => '',
        'encoding' => 'utf8',
    ),
    's3' => array(
        'datasource' => 'S3'
        , 'useS3' => false
        , 'bucket_name' => 'development'
    ),
);
