<?php
/* ###############################################################################
 *
 * システム名
 *   ラジカルオプティ サロン事業 POSシステム
 *
 * 機能
 *   CahePHP 設定読みこみ
 *
 * バージョン
 *   0.0.0_0
 *
 * 履歴
 *   2016/02/08 K.Sonohara
 *     新規作成
 *
 * ###############################################################################
 */

// ###############################################################################
//  変数・定義値
// ###############################################################################

// ###############################################################################
//  クラス
// ###############################################################################

// ###############################################################################
//  関数
// ###############################################################################

// ###############################################################################
//  処理
// ###############################################################################

Cache::config('default', ['engine' => 'File']);

Configure::write('Dispatcher.filters', [
    'AssetDispatcher',
    'CacheDispatcher',
]);

App::uses('CakeLog', 'Log');

CakeLog::config('log4php', [
    'engine' => 'Log4PhpCustomLogger',
    'properties_path' => APP.'Config'.DS.APP_ENV.DS.'log4php.properties'
]);

App::uses('AppErrorHandler', 'Lib/Error');
App::uses('AppExceptionRenderer', 'Lib/Error');

Configure::load('appConfig');
Configure::load('appMessage');
Configure::load('appConstant');

Configure::write('Config.language', 'jpn');

App::build([
    'Model' => [
        APP.'Model'.DS,
        APP.'Model'.DS.'Validators'.DS
    ]
]);
