<?php
/* ###############################################################################
 *
 * システム名
 *   ラジカルオプティ サロン事業 POSシステム
 *
 * 機能
 *   CahePHP セッション設定 [テスト環境]
 *
 * バージョン
 *   0.0.0_0
 *
 * 履歴
 *   2016/02/08 K.Sonohara
 *     新規作成
 *
 * ###############################################################################
 */

// ###############################################################################
//  変数・定義値
// ###############################################################################

/**
 * rdb: モデル及びセッション及び用データベース設定
 * s3: AWS S3設定.
 */
Configure::write('Session', array(
    'defaults' => 'database',
    'cookie' => 'SID',
    'timeout' => 30,
    'ini' => array(
        'session.cookie_lifetime' => 2580000, 'session.gc_maxlifetime' => 2580000, 'session.gc_probability' => 1, 'session.gc_divisor' => 100,
    ),
    'handler' => array(
        'model' => 'Session',
    ),
));
